{
  "codetypes": [
    {
      "shortCode": "CBW9YN",
      "id": 1,
      "description": "faucibus orci luctus et ultrices posuere cubilia Curae Donec tincidunt. Donec vitae erat vel pede blandit congue. In scelerisque scelerisque dui. Suspendisse ac metus vitae"
    },
    {
      "shortCode": "JBG1PC",
      "id": 2,
      "description": "Donec nibh. Quisque nonummy ipsum non arcu. Vivamus sit amet"
    },
    {
      "shortCode": "TRH8OL",
      "id": 3,
      "description": "fringilla euismod enim. Etiam gravida molestie arcu. Sed eu"
    },
    {
      "shortCode": "XOJ4OS",
      "id": 4,
      "description": "amet, risus. Donec nibh enim, gravida sit amet,"
    },
    {
      "shortCode": "YBA5TP",
      "id": 5,
      "description": "aliquet, sem ut cursus luctus, ipsum leo elementum sem, vitae aliquam eros turpis non enim. Mauris quis turpis vitae purus gravida"
    },
    {
      "shortCode": "KYK2IY",
      "id": 6,
      "description": "tristique senectus et netus et malesuada fames ac turpis egestas. Fusce aliquet"
    },
    {
      "shortCode": "UPY2DR",
      "id": 7,
      "description": "sem elit, pharetra"
    },
    {
      "shortCode": "FNC3IZ",
      "id": 8,
      "description": "pede nec ante blandit"
    },
    {
      "shortCode": "NQP8PD",
      "id": 9,
      "description": "lectus convallis est, vitae sodales nisi magna sed dui. Fusce aliquam, enim nec tempus scelerisque,"
    },
    {
      "shortCode": "WJK3KS",
      "id": 10,
      "description": "lectus pede et risus. Quisque libero lacus, varius et, euismod et, commodo at, libero. Morbi accumsan laoreet ipsum. Curabitur consequat, lectus sit amet luctus vulputate, nisi"
    },
    {
      "shortCode": "NCE6CD",
      "id": 11,
      "description": "consectetuer adipiscing elit. Aliquam auctor, velit eget laoreet posuere, enim nisl elementum purus, accumsan interdum libero dui nec ipsum."
    },
    {
      "shortCode": "UEH2SN",
      "id": 12,
      "description": "Phasellus nulla. Integer vulputate, risus a ultricies adipiscing, enim mi tempor lorem,"
    },
    {
      "shortCode": "UYM1WM",
      "id": 13,
      "description": "ullamcorper, velit in aliquet lobortis, nisi nibh lacinia orci, consectetuer euismod est arcu ac"
    },
    {
      "shortCode": "BDC5EF",
      "id": 14,
      "description": "egestas nunc sed libero. Proin sed turpis"
    },
    {
      "shortCode": "GYA4DV",
      "id": 15,
      "description": "enim commodo hendrerit. Donec porttitor tellus non magna. Nam ligula elit, pretium et, rutrum non, hendrerit id, ante. Nunc mauris sapien, cursus in, hendrerit"
    },
    {
      "shortCode": "ZKW7VM",
      "id": 16,
      "description": "amet diam eu dolor egestas rhoncus. Proin nisl sem, consequat nec, mollis vitae, posuere at, velit. Cras lorem lorem, luctus ut, pellentesque eget, dictum placerat, augue. Sed"
    },
    {
      "shortCode": "SZK1CU",
      "id": 17,
      "description": "lorem, eget mollis lectus pede et risus. Quisque libero lacus, varius et, euismod et, commodo at,"
    },
    {
      "shortCode": "BPS7XQ",
      "id": 18,
      "description": "tellus sem mollis dui, in sodales elit erat vitae risus. Duis a mi"
    },
    {
      "shortCode": "MMJ2OH",
      "id": 19,
      "description": "nulla. Integer urna. Vivamus molestie dapibus ligula. Aliquam erat volutpat. Nulla dignissim. Maecenas ornare egestas ligula."
    },
    {
      "shortCode": "IKJ5QD",
      "id": 20,
      "description": "sed consequat auctor, nunc nulla vulputate dui, nec tempus mauris erat eget ipsum. Suspendisse sagittis. Nullam vitae diam. Proin dolor. Nulla semper tellus id"
    },
    {
      "shortCode": "LQL2VX",
      "id": 21,
      "description": "eu, ligula. Aenean euismod mauris eu elit. Nulla facilisi."
    },
    {
      "shortCode": "MDP8XI",
      "id": 22,
      "description": "Nunc laoreet lectus quis massa. Mauris vestibulum, neque sed dictum eleifend, nunc"
    },
    {
      "shortCode": "CPH2VN",
      "id": 23,
      "description": "et magnis"
    },
    {
      "shortCode": "ZUN7BQ",
      "id": 24,
      "description": "Quisque nonummy ipsum non arcu. Vivamus sit amet"
    },
    {
      "shortCode": "IGP5SB",
      "id": 25,
      "description": "mus. Proin vel arcu eu odio tristique pharetra. Quisque ac libero nec ligula consectetuer rhoncus. Nullam velit dui, semper et, lacinia vitae, sodales at, velit. Pellentesque ultricies"
    },
    {
      "shortCode": "ZMQ7QO",
      "id": 26,
      "description": "luctus ut, pellentesque"
    },
    {
      "shortCode": "GCR8QY",
      "id": 27,
      "description": "euismod ac, fermentum vel, mauris. Integer"
    },
    {
      "shortCode": "IBB3HS",
      "id": 28,
      "description": "Nullam enim. Sed nulla ante, iaculis nec, eleifend non, dapibus rutrum, justo. Praesent luctus. Curabitur egestas nunc sed libero. Proin sed"
    },
    {
      "shortCode": "TMR8PS",
      "id": 29,
      "description": "justo eu arcu."
    },
    {
      "shortCode": "PGS0LL",
      "id": 30,
      "description": "Sed congue, elit sed consequat auctor, nunc nulla vulputate dui, nec tempus mauris erat eget ipsum. Suspendisse"
    },
    {
      "shortCode": "NQR4HL",
      "id": 31,
      "description": "a purus. Duis"
    },
    {
      "shortCode": "WGN8JF",
      "id": 32,
      "description": "metus. In nec orci. Donec nibh. Quisque nonummy ipsum non"
    },
    {
      "shortCode": "XIO8NC",
      "id": 33,
      "description": "porttitor eros"
    },
    {
      "shortCode": "IAG1WY",
      "id": 34,
      "description": "arcu. Morbi sit amet massa. Quisque porttitor eros nec tellus. Nunc lectus pede, ultrices a, auctor"
    },
    {
      "shortCode": "KQE7YT",
      "id": 35,
      "description": "odio sagittis semper. Nam tempor diam dictum sapien. Aenean massa. Integer vitae nibh. Donec est mauris, rhoncus id, mollis nec, cursus a, enim. Suspendisse aliquet, sem ut"
    },
    {
      "shortCode": "TRO0SJ",
      "id": 36,
      "description": "elementum at, egestas a, scelerisque sed, sapien. Nunc pulvinar arcu et pede. Nunc sed orci lobortis augue scelerisque mollis."
    },
    {
      "shortCode": "SPB6PE",
      "id": 37,
      "description": "quis diam. Pellentesque habitant morbi tristique"
    },
    {
      "shortCode": "BBS6UM",
      "id": 38,
      "description": "ullamcorper magna. Sed eu eros. Nam consequat dolor vitae dolor. Donec fringilla. Donec feugiat metus sit amet ante. Vivamus non lorem vitae odio sagittis semper. Nam"
    },
    {
      "shortCode": "WAO9AQ",
      "id": 39,
      "description": "nec, eleifend non, dapibus rutrum, justo. Praesent luctus. Curabitur egestas nunc sed libero. Proin sed turpis nec mauris blandit mattis. Cras eget nisi dictum"
    },
    {
      "shortCode": "RBQ7KU",
      "id": 40,
      "description": "non, cursus non, egestas a, dui. Cras pellentesque. Sed dictum. Proin eget odio. Aliquam vulputate ullamcorper magna. Sed eu eros. Nam consequat"
    },
    {
      "shortCode": "FZB3YY",
      "id": 41,
      "description": "sapien imperdiet ornare. In faucibus. Morbi vehicula. Pellentesque tincidunt tempus risus. Donec egestas. Duis ac arcu. Nunc mauris. Morbi non sapien molestie orci tincidunt adipiscing. Mauris molestie pharetra"
    },
    {
      "shortCode": "ZKN2OX",
      "id": 42,
      "description": "blandit congue. In scelerisque scelerisque dui. Suspendisse ac metus vitae velit egestas lacinia. Sed congue, elit sed consequat auctor, nunc nulla vulputate dui, nec tempus mauris erat"
    },
    {
      "shortCode": "QTD7HX",
      "id": 43,
      "description": "enim commodo hendrerit. Donec porttitor tellus non magna. Nam ligula elit, pretium et, rutrum non, hendrerit id, ante. Nunc mauris sapien, cursus in, hendrerit consectetuer, cursus et,"
    },
    {
      "shortCode": "FHE1MH",
      "id": 44,
      "description": "adipiscing ligula. Aenean gravida nunc"
    },
    {
      "shortCode": "QAF2YT",
      "id": 45,
      "description": "magna. Nam ligula elit,"
    },
    {
      "shortCode": "CUU8KM",
      "id": 46,
      "description": "non ante bibendum ullamcorper. Duis cursus, diam at pretium aliquet, metus urna convallis erat, eget tincidunt dui augue eu tellus."
    },
    {
      "shortCode": "UIW7KR",
      "id": 47,
      "description": "sit amet ultricies sem magna nec quam. Curabitur vel lectus. Cum sociis natoque penatibus et magnis dis parturient montes, nascetur ridiculus mus. Donec"
    },
    {
      "shortCode": "DMH4EC",
      "id": 48,
      "description": "Donec vitae erat vel pede blandit congue. In scelerisque scelerisque dui. Suspendisse ac metus vitae velit egestas lacinia. Sed congue, elit sed consequat auctor, nunc nulla vulputate"
    },
    {
      "shortCode": "HDA5BT",
      "id": 49,
      "description": "fringilla est. Mauris eu turpis. Nulla aliquet. Proin velit. Sed malesuada augue ut lacus. Nulla tincidunt, neque vitae semper egestas, urna justo faucibus lectus,"
    },
    {
      "shortCode": "EXS8XW",
      "id": 50,
      "description": "velit. Sed malesuada augue ut"
    },
    {
      "shortCode": "ABC1DN",
      "description": "SYk6 added this",
      "id": 51
    },
    {
      "shortCode": "BK1234",
      "description": "Newly Created For Test",
      "id": 52
    },
    {
      "shortCode": "ABC2NKM",
      "description": "Created",
      "id": 53
    },
    {
      "shortCode": "CDY1KL",
      "description": "Test Creation",
      "id": 54
    },
    {
      "shortCode": "CDE4TU",
      "description": "Should get added to the list",
      "id": 55
    },
    {
      "shortCode": "NEW1CT",
      "description": "Code Type ITem One",
      "id": 56
    },
    {
      "shortCode": "NEW2CT",
      "description": "sNACKBAR WOULD BE SHOWN",
      "id": 57
    },
    {
      "shortCode": "NEW3CT",
      "description": "Saving Third Code Type With Table As View",
      "id": 58
    }
  ]
}